app/controllers/application_controller.rb

  def fetch_user # TODO test this with both find and by Id in console
    @current_user = User.find_by :id => session[:user_id] if session[:user_id].present?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]