app/controllers/session_controller.rb

  def create # take login form data
    user = User.find_by :email => params[:email] # put user params into variable
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jonesy@ga.co"], ["LIMIT", 1]]